{
    "_comment": "Bio is used on main page and epk."
    ,"home-page-bio": ["Lazarus Lake, the alt-country outfit of singer/songwriter Michael Jones, arrives with its debut record Family Tree, out May 30th, 2025 on Kindness Records."
            , "Blending homespun southern rock with the no-frills directness of Americana tradition, Family Tree explores the ties that bind and the ways that they’re strained—with an eye to redeem the moments when life falls apart and to keep alive the memory of loved ones lost."]
    ,"bio": ["Lazarus Lake, the alt-country outfit of singer/songwriter Michael Jones, arrives with its debut record Family Tree, out May 30th, 2025 on Kindness Records. Blending homespun southern rock with the no-frills directness of Americana tradition, Family Tree explores the ties that bind and the ways that they’re strained—with an eye to redeem the moments when life falls apart and to keep alive the memory of loved ones lost."
, "Listening to Family Tree, you hear a confident thesis from an assured artist. It’s a record built on the back of long nights and longer weeks in the years that Jones spent gigging solo and in country bands through the first half of the decade. Though a debut record, Family Tree wisely avoids hollow flashes and flourishes to prove Lazarus Lake as an act worthy of attention. Instead, it focuses on offering stories of loss and growth that are guided by a gentle hand."
, "This isn't to say, though, that Family Tree lacks style, humor, or emotional weight. Whether it’s the tuba performed by Jones on the centerpiece track “Glaciers,” the sly narrative ambiguity of first single “Someone New,” or the rollicking irreverence of second single “Ford Ranger,” Family Tree remains a consistently engaging listen for its entire runtime."
, "Woven throughout the record is a heartfelt throughline that charts the legacy of family since passed. “Nissan Frontier” uses the titular vehicle as a symbol for Jones’ relationship with his aunt, and the sibling title tracks that bookend the record explore Jones’ relationship with his grandfather and father. Covering adoration, regret, grief, and everything in between, these songs frame the simple, elegant core of the album: even as it ends—and regardless of how you feel about it at any given time—your family is forever."]
}
